open
close
read
write
socket
bind
connect
listen
send
sendto
recv
recvfrom
shutdown
getsockname
getpeername
socketpair
setsockopt
getsockopt
sendmsg
sendmmsg
recvmsg
recvmmsg
creat
pipe
eventfd
futex
stat
lstat
fstat
stat64
lstat64
fstat64
epoll_wait
poll
select
lseek
llseek
getcwd
chdir
fchdir
pread
pwrite
readv
writev
preadv
pwritev
signalfd
kill
tkill
tgkill
nanosleep
timerfd_create
inotify_init
getrlimit
setrlimit
prlimit
fcntl
brk
mmap
mmap2
munmap
splice
ptrace
ioctl
rename
renameat
symlink
symlinkat
sendfile
quotactl
setresuid
setresgid
setuid
setgid
getuid
geteuid
getgid
getegid
getresuid
getresgid
clone
fork
vfork
getdents
getdents64
setns
flock
accept
semop
semctl
ppoll
mount
semget
access
chroot
setsid
mkdir
rmdir
unshare
execve
setpgid
seccomp
unlink
unlinkat
mkdirat
openat
link
linkat
fchmodat
chmod
fchmod
renameat2
userfaultfd
openat2
mprotect
execveat
copy_file_range
clone3
open_by_handle_at
io_uring_setup
io_uring_enter
io_uring_register
mlock
munlock
mlockall
munlockall
capset
dup2
dup3
dup
bpf
mlock2
fsconfig
epoll_create
epoll_create1
chown
lchown
fchown
fchownat
umount
accept4
umount2
pipe2
inotify_init1
eventfd2
signalfd4
prctl
memfd_create
pidfd_getfd
pidfd_open
init_module
finit_module
mknod
mknodat
sigreturn
s390_runtime_instr
s390_sthyi
readdir
sync_file_range
faccessat2
sched_getattr
rseq
nfsservctl
sigsuspend
getpmsg
set_mempolicy_home_node
io_pgetevents
statx
epoll_ctl_old
mbind
move_pages
migrate_pages
landlock_add_rule
landlock_restrict_self
pkey_alloc
close_range
kexec_file_load
memfd_secret
fadvise64
getrandom
sigaltstack
process_vm_writev
fallocate
waitpid
nice
olduname
sgetmask
_newselect
socketcall
sigprocmask
fstatat64
process_vm_readv
fstatfs64
statfs64
msgctl
msgget
process_mrelease
msgrcv
perf_event_open
getcpu
create_module
preadv2
vmsplice
rt_sigtimedwait
mq_open
modify_ldt
timerfd_settime
getitimer
semtimedop
rt_sigreturn
rt_sigpending
sched_get_priority_min
sched_getscheduler
kcmp
open_tree
setpriority
sched_setscheduler
sched_getparam
fdatasync
pkey_mprotect
clock_nanosleep
getsid
signal
sched_yield
get_robust_list
set_tid_address
getpgid
wait4
rt_sigaction
mq_timedreceive
rt_tgsigqueueinfo
rt_sigprocmask
_sysctl
epoll_wait_old
vhangup
io_destroy
getppid
exit
pivot_root
cachestat
mincore
msgsnd
sysinfo
acct
epoll_pwait
sysfs
restart_syscall
clock_adjtime
sync
getpid
utime
name_to_handle_at
sched_setparam
stime
pause
timerfd
msync
rt_sigsuspend
landlock_create_ruleset
lremovexattr
remap_file_pages
times
sched_get_priority_max
fanotify_mark
statfs
readahead
pkey_free
time
uname
process_madvise
ioprio_get
pselect6
swapon
settimeofday
iopl
set_mempolicy
ftruncate
syncfs
readlink
gettimeofday
s390_guarded_storage
sched_rr_get_interval
setgroups
timer_gettime
ioprio_set
futimesat
reboot
get_kernel_syms
uselib
ioperm
syslog
mremap
truncate
ustat
timer_settime
quotactl_fd
umask
clock_settime
mount_setattr
getpriority
get_mempolicy
move_mount
alarm
getxattr
personality
getpgrp
fstatfs
mq_getsetattr
setreuid
setregid
setfsuid
setfsgid
s390_pci_mmio_read
ssetmask
madvise
swapoff
add_key
membarrier
gettid
query_module
shmat
lsetxattr
lookup_dcookie
fsetxattr
ipc
fsync
lgetxattr
futex_waitv
fgetxattr
sigpending
shmdt
listxattr
setxattr
mq_timedsend
sigaction
arch_prctl
waitid
llistxattr
flistxattr
timer_create
removexattr
delete_module
fremovexattr
utimensat
rt_sigqueueinfo
sched_getaffinity
sched_setattr
epoll_pwait2
fsopen
fanotify_init
request_key
sched_setaffinity
io_submit
set_thread_area
get_thread_area
epoll_ctl
pidfd_send_signal
inotify_add_watch
setdomainname
io_setup
s390_pci_mmio_write
io_getevents
io_cancel
timer_getoverrun
timerfd_gettime
setitimer
clock_gettime
fsmount
exit_group
getrusage
sethostname
timer_delete
idle
shmget
readlinkat
shmctl
set_robust_list
utimes
adjtimex
mq_unlink
pwritev2
mq_notify
kexec_load
clock_getres
keyctl
bdflush
tee
getgroups
inotify_rm_watch
fspick
newfstatat
capget
faccessat
